package com.yehya1.first_app;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.view.WindowManager;
import android.widget.Button;

import androidx.appcompat.app.AppCompatActivity;

import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;
import com.google.android.gms.ads.MobileAds;

public class ContentActivity extends AppCompatActivity {


    InterstitialAd interstitialAd1;
    InterstitialAd interstitialAd2;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_content);

        getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN, WindowManager.LayoutParams.FLAG_FULLSCREEN);

        MobileAds.initialize(this, "ca-app-pub-1971289391126138~7596416275");

        interstitialAd1 = new InterstitialAd(this);
        interstitialAd1.setAdUnitId("ca-app-pub-1971289391126138/7196923030");
        interstitialAd1.loadAd(new AdRequest.Builder().build());

        interstitialAd2 = new InterstitialAd(this);
        interstitialAd2.setAdUnitId("ca-app-pub-1971289391126138/7216926722");
        interstitialAd2.loadAd(new AdRequest.Builder().build());

        Button button1 = findViewById(R.id.button1);
        Button button2 = findViewById(R.id.button2);
        Button button3 = findViewById(R.id.buton3);



        button3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext() , MainActivity.class);
                startActivity(intent);
            }
        });

        button2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                interstitialAd1.show();


                Intent intent = new Intent(getApplicationContext() , ShowIntroductionAndDefinition.class);
                intent.putExtra("titleContent" , "ما هو كتاب الأربعين النووية");
                intent.putExtra("content" , "يعد كتاب الأربعين النووية من أهم كتب الأحاديث النبوية، لكونه سجلًا للأحاديث المهمة، وذخيرة للفقه الإسلامي\n" +
                        "\n" + "وينقسم الكتاب إلى قسمين:" + "\n" + "القسم الأول: المقدمة:\n" +
                        "\n" +
                        "فقد استهل كتابه بمقدمة ذكر فيها الباعث الذي بعثه إلى تأليف هذا الكتاب، والمنهج المتبع في الكتاب، وأردف ذلك بلمحة يسيرة عن تاريخ جمع الأربعين النووية، وما يـتميز به كتابه؛ حيث قال: ثم التزم في هذه الأربعين أن تكون صحيحةً عندَهُ\n" +
                        "\n" +
                        "\n" +
                        "\n" + "وقد أشار في مقدمته إلى رأيه في استدلال بالحديث الضعيف، ورأي العلماء في ذلك قـال: \"وقد اتفق العلماء على جواز العمل بالحديث الضعيف في فضائل الأعمال\"\n" +
                        "\n" + "القسم الثاني: صلب الكتاب:" + "\n" + "قد أبدع النووي في التأليف، وأثبت مهارته في الترتيب، حيث رتب هذه الأحاديث ترتيبًا مرقمًا، من الحديث الأول إلى الحديث الثاني والأربعين، ولم يرتبها حسب الأبواب الفقهية المتداولة في كتب القدامى، وقد ذكر الأحاديث مـحذوفة الأسانيد، ويختم كل حديث بذكر راوي الحديث، مع الإشارة إلى موقف الراوي بالنسبة للحديث في أغلب الأحايين، مثل قوله في الحديث التاسع والعشرين: \"رواه الترمذي، وقال: حديث حسن\"\n" +
                        "\n" + "وفي الغالب إذا كان للحديث رواية أخرى يذكرها، كما فعل في الحديث الخامس؛ حيث ذكر الحديث وأشار إلى راويه ثم قال: \"وفي رواية لمسلم\"\n" +
                        "\n" +  "إشارة إلى أن لفظ مسلم يخالف لفظ البخاري، وأما إذا كان للحديث روايات كثيرة متعددة مختلفة يشير إلى ذلك بقوله: \"رواه مسلم بهذا اللفظ\"\n" +
                        "\n" + "، ولم يفعل هذه الأعمال الجبارة إلا لرفع الالتباس والإبهام.\n" +
                        "\n" + "\n" + "\n" + "\n" + "\n" +
                        "مميزات الكتاب:" + "\n" + "فالظاهر أن هذا الكتاب يتميز بالأمور الآتية:\n" +
                        "\n" + "1- حسن الترتيب، وجودة البنية؛ حيث افتتح كتابه بحديث عمر رضي الله عنه وهو حديث: \"إنما الأعمال بالنيات\"، لما يشمله هذا الحديث من مسائل فقهية رفيعة، فـلهذا قال عبدالرحمن بن مهدي: \"لو صنفت الأبواب، لجعلت حديث عمر في الأعمال بالنية في كل باب\"، وقد قال: \"من أراد أن يصنف كتابًا، فليبدأ بحديث \"الأعمال بالنيات\"\n" +
                        "\n" + "2- سهولة الحفظ، كأنه كتاب مقرر؛ لأن أكثر أحاديث الكتاب من جوامع كلمه، وقد ذكرها محذوفة الأسانيد، فقد أشار إلى ذلك في قوله: \"وأذكرها محذوفة الأسانيد؛ ليسهُل حفظها، ويعم الانتفاع بها\n" +
                        ".");
                startActivity(intent);


            }
        });

        button1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                interstitialAd2.show();

                Intent intent = new Intent(getApplicationContext() , ShowIntroductionAndDefinition.class);
                intent.putExtra("titleContent" , "مقدمة الأربعين النووية");
                intent.putExtra("content" , "قول النووي -رحمه الله-: “فقد رُوِّينا عن علي بن أبي طالب -أمير المؤمنين-، وعبد الله بن مسعود بن غافل الهذلي، ومعاذ بن جبل، وأبي الدرداء، وابن عمر، وابن عباس، وأنس بن مالك، وأبي هريرة، وأبي سعيد الخدري -رضي الله عنهم- من طرق كثيرات بروايات متنوعات”. النووي يروي عن هؤلاء الصحابة -رضي الله عنهم- بواسطة يعني بالأسانيد، ولذا رأي ابن الصلاح في مثل هذا أن يقال: رُوِّينا، ولا يقال: روَيْنا.\n" +
                        "\n" +
                        "الحديث الذي سيذكره النووي مروي عن جمع غفير من الصحابة، وكل صحابي له رواة، وكل تابع له رواة، فالأسانيد كثيرة جدًا، والطرق لهذا الحديث كثيرة، لكنه ضعيف بجميع طرقه وألفاظه. اتفق الحفاظ على ضعفه، وطرق هذا الحديث كلها شديدة الضعف، ولذا أورد ابن الجوزي هذا الحديث في كتابه “العلل المتناهية” بطرقه وبين أنها كثير منها موضوع، ومنها ما هو شديد الضعف, فلا يجبر بعضها بعضًا, بخلاف الضعيف الذي ليس ضعفه بشديد إذا جاء من طرق يجبر بعضها بعضًا يرتقي إلى الحسن لغيره . ولذا اتفق الحفاظ -كما سيأتي في كلام المؤلف- على أنه ضعيف وإن كثرت طرقه، وهذا هو المعمول به عند أهل العلم.\n" +
                        "والحديث هو “أن رسول الله -صلى الله عليه وسلم- قال: (( من حفظ على أمتي أربعين حديثًا من أمر دينها بعثه الله يوم القيامة في زمرة الفقهاء والعلماء))”\n" +
                        "في “أمر دينها” يعني: لو جمع شخص أربعين حديثًا في البيوع، أو في الأطعمة، فإنه يدخل في هذا الحديث فالمعاملات من الدين فإذا قصد بذلك معرفة ما يجوز وما لا يجوز، وجمع الأحاديث الدالة على العقود الصحيحة, والفاسدة, والباطلة فهذا من الدين. الدين أعم من أن يكون مجرد عبادات, أو معاملات, أو جنايات, أو غير ذلك، الدين يكون دينا بجميع أبوابه على ما سيأتي في حديث جبريل -عليه السلام- لما سأل النبي -عليه الصلاة والسلام- عن الإسلام, والإيمان, والإحسان, ثم قال -عليه الصلاة والسلام- : ((هذا جبريل أتاكم يعلمكم دينكم))، يعني جميع أبوب الدين. فيطلق الدين على جميع الأبواب.\n" +
                        "\n" +
                        "((من حفظ على أمتي أربعين حديثًا من أمر دينها)) هل يكفي أن يعمد إلى الحفظ، ويحفظ هذه الأربعين أو غيرها من الأربعينيات، فيدخل في الحديث لعموم ((من حفظ)) والحفظ حفظ الصدر كما هو الأصل؟ أو لا بد أن يؤلف ويجمع للناس أربعين حديثًا مثل ما فعل النووي وغيره؟\n" +
                        "الحفظ أعم من أن يكون حفظ صدر، أو حفظ كتاب.\n" +
                        "((بعثه الله يوم القيامة في زمرة الفقهاء والعلماء))\n" +
                        "وكما هو معلوم هذا حديث ضعيف شديد الضعف عند أهل العلم، وفي رواية ((بعثه الله فقيهًا عالمًا))، وفي راوية أبي الدرداء ((وكنت له يوم القيامة شافعًا وشهيدًا))، وفي رواية ابن مسعود -رضي الله عنه- ((قيل له: ادخل من أي أبواب الجنة شئت)) وفي رواية ابن عمر -رضي الله عنه- ((كتب في زمرة العلماء، وحشر في زمرة الشهداء)).\n" +
                        "ولا شك أن هذا ترغيب عظيم في جمع الأربعين لو صح، لكنه -كما قال النووي-: “اتفق الحفاظ على أنه حديث ضعيف وإن كثرت طرقه”، “وإن كثرت طرقه”، وهذه الكثرة لم تحصل مثلها لكثير من الأحاديث الصحيحة، فالعبرة بالأسانيد ونظافتها وصحتها، وصحة النسبة إلى النبي -عليه الصلاة والسلام- لا بكثرة الطرق.\n" +
                        "\n" +
                        "يقول المؤلف -رحمه الله تعالى-: “وقد صنف العلماء -رضي الله عنهم- في هذا الباب ما لا يحصى من المصنفات”، كتبٌ كثيرةٌ في الأربعين لا يمكن حصرها ولا عدها في أبواب متفرقة متنوعة متكاثرة من أبواب الدين.\n" +
                        "قوله -رحمه الله-: “فأول من علمته صنف فيه عبد الله بن المبارك” الإمام الزاهد المجاهد عبد الله بن المبارك، “ثم محمد بن أسلم الطوسي العالم الرباني”، العالم الرباني الذي تعلم, وعلم, وعمل, وعلّم، وربى الناس على العلم بدءًا بصغاره قبل كباره . “ثم الحسن بن سفيان النَّسوي أو النسائي وأبو بكر الآجري”،\n" +
                        "\n" +
                        "الأول: صاحب النسائي،\n" +
                        "\n" +
                        "والثاني: صاحب أبي داود، “وأبو بكر محمد بن إبراهيم الأصفهاني, والدارقطني” الإمام أبو الحسن المعروف، “والحاكم” أبو عبد الله محمد بن عبد الله بن البيّع النيسابوري، “وأبو نعيم الأصبهاني, وأبو عبد الرحمن السلمي، وأبو سعد الماليني، وأبو عثمان الصابوني، وعبد الله بن محمد الأنصاري، وأبو بكر البيهقي، وخلائق لا يحصون من المتقدمين والمتأخرين”. ألّف بعضهم أربعين أربعين، يعني أربعين كتابًا كلها أربعين، وكل أربعين في باب من أبواب الدين.\n" +
                        "\n" +
                        "يقول المؤلف -رحمه الله تعالى-: “ وقد استخرت الله تعالى في جمع أربعين حديثًا اقتداء بهؤلاء الأئمة الأعلام وحفاظ الإسلام”، هل العبرة بما ثبت عن الله وعن رسوله -عليه الصلاة والسلام-، أو بما ثبت عن غير الله وعن غير رسوله -عليه الصلاة والسلام- مهما رسخت قدمه في الإسلام وعلا شأنه؟\n" +
                        "العبرة بما ثبت عن الله وعن رسوله.\n" +
                        "\n" +
                        "هذه هي الحجج الملزمة, لا كونه ثبت عن فلان أو علان أو فعل كذا. لا شك أن كون الإمام السابق من أهل الاقتداء, والائتساء, والاتباع تستروح النفس وتميل إلى تقليده؛ لأن عادته وديدنه ألّا يعمل إلا بشيء له أصل، لكن يبقى أن الاقتداء وأن الأسوة إنما تكون بالنبي -عليه الصلاة والسلام-.\n" +
                        "\n" +
                        "إن كان الحفاظ اتفقوا على أنه حديث ضعيف, فلماذا عمل به أهل العلم، وصنفوا الأربعينات؟\n" +
                        "يقول المؤلف: “وقد اتفق العلماء على جواز العمل بالحديث الضعيف في فضائل الأعمال”.\n" +
                        "هذا الاتفاق منقوض لوجود المخالف، فمن أهل العلم من لا يرى العمل بالضعيف مطلقًا، ويبقى أنه قول الأكثر وحينئذ نقول: إن العمل بالضعيف في فضائل الأعمال هو قول الأكثر أو هو قول الجمهور بشروط يشترطونها، وهي:\n" +
                        "1- ألا يكون الضعف شديدًا.\n" +
                        "2- أن يندرج تحت أصل عام.\n" +
                        "3- أن لا يعتقد عند العمل به ثبوته.\n" +
                        "\n" +
                        "نأتي إلى الشرط الأول وهو ألا يكون الضعف شديدًا. حديث الباب ((من حفظ على أمتي أربعين حديثًا)) شديد الضعف، فانتفى أول شرط من شروط العمل بالضعيف, فلا يصلح أن يُستدلَّ به للعمل على مثل هذه الأربعين، ولذلك لم يقل النووي -رحمه الله-: “ألفتها عملًا بالحديث”، إلا أنه قدَّم الاقتداء بأهل العلم بهؤلاء الأئمة الأعلام، قدم الاقتداء بهم على العمل بهذا الحديث لشدة ضعفه.\n" +
                        "\n" +
                        "الشرط الثاني: أن يندرج تحت أصل عام. الاندراج تحت أصل عام ذكره النووي في مقدمته، وذلك قوله: “ومع هذا فليس اعتمادي على هذا الحديث بل على قوله -صلى الله عليه وسلم- في الأحاديث الصحيحة ((ليبلغ الشاهد منكم الغائب))، وقوله -صلى الله عليه وسلم-: ((نضر الله امرًا سمع مقالتي فوعاها فأداها كما سمعها))،” ومعنى ذلك أن هذا الحديث اندرج تحت هذه الأصول, فالشرط الثاني متحقق.\n" +
                        "\n" +
                        "الشرط الثالث: أن لا يعتقد عند العمل به ثبوته. معناه أنك أثناء تأليفك لأربعين لا تعتقد ثبوت حديث ((من حفظ على أمتي)) وإنما تعتقد الاحتياط؛ لأنه إن ثبت ثبت الموعود به وإلا فلا ضرر فهذا مرادهم.\n" +
                        "\n" +
                        "وذلك بخلاف لو أن إنسانًا استصحب الحث على النوافل، نوافل الصيام أو نوافل الصلاة مثلًا فقال: “أنا أستصحب هذا الأصل العام، وأصلي في كل يوم ما بين الساعة التاسعة إلى العاشرة عشر ركعات”, جعل هذا ديدن له, لا يخلفه في سفر ولا حضر, والترغيب في كثرة الصلاة هو قوله -صلى الله عليه وسلم-: ((أعنّي على نفسك بكثرة السجود)). هل يصح هذا أو نقول: ابتدع؟\n" +
                        "لا يصح ذلك؛ لأن العبادة ينظر إليها من جهات: في كيفيتها, وفي قدرها, وفي وقتها, وفي مكانها، لو التزم مكانًا معينًا فقال: “إنه جاء الحث على الصلوات فأصلي عشرين ركعة كل يوم في هذه الزاوية لا أتعداها”، فكونه يرى أن هذه الزاوية أبعد له وأحفظ لصلاته هذا مقصد شرعي، لكن ليست لها ميزة بحيث لا يتعداها، الأمور العبادية ينظر فيها إلى مقاصد الشرع, وما ورد عن الشرع هو الأصل، فلا بد أن نهتم بهذا.\n" +
                        "فتخصيص المكان أو الزمان بدون مخصص شرعي ابتداع -إحداث في الدين-.\n" +
                        "\n" +
                        "قول المؤلف -رحمه الله-: “ومع هذا فليس اعتمادي على هذا الحديث، بل على قوله -صلى الله عليه وسلم- في الحديث الصحيح ((ليبلغ الشاهد منكم الغائب))” نعم هذا أصل للتبليغ, لكن هل يصلح أن يكون أصلًا للعدد؟ ما يصلح أن يكون أصلًا للعدد. فالإنسان إذا بلغ أربعين حديثًا يدخل في قوا النبي -عليه الصلاة والسلام-: ((ليبلغ الشاهد منكم الغائب)), لكن الالتزام بالعدد ما الذي يصلح أن يكون أصلًا له -وقد قلنا إن الحديث ضعيف بل شديد الضعف-؟ فالمعوَّل في هذه المسألة على هؤلاء العلماء الأعلام. ونعود فنقول إنهم جمع غفير لا يحصون، فإن ثبت الخبر فهذا هو المطلوب، وإن لم يثبت فالمعول على من صنف في الأربعين سلف من هؤلاء الأئمة -وهم أعلام مشهود لهم بالفضل والعلم والورع. وعلى كل حال لو انشغل الإنسان بما هو أصح من هذا وألف تأليفًا مرسلًا مطلقًا كان أولى من أن يقتصر على هذا العدد لأمرين:\n" +
                        "الأمر الأول: أن الاقتصار على هذا العدد لا يوجد ما يدل عليه.\n" +
                        "الأمر الثاني: أنه يكون على حساب غيره؛ وذلك أن التقيد بالأربعين يحرم من أحاديث كثيرٌ منها أهم مما ذكر في الأربعين. ولذا نجد النووي -رحمه الله تعالى- لم يتقيَّد بالأربعين بدقة بل جعلها اثنين وأربعين حديثًا. وقد يقال: إن هذا جاري على طريقة العرب في حذف الكسر، لكن يبقى أن الإنسان يؤلف وهو مرتاح، بلغت ستين، بلغت سبعين، فيؤلف بقدر الحاجة وهذا هو الأصل. أما أن يحصر نفسه بعدد معين ثم يترتب على ذلك تسطير المرجوح وترك الراجح كل هذا محافظة على العدد، هذا لا شك أن الذي جر إليه هو اعتماد هذا العدد الذي لا يدل عليه دليل.\n" +
                        "\n" +
                        "اعتنى العلماء بهذه الأربعين وشرحوها بشروح كثيرة، ولا يحصى كم من شرح مطول ومختصر ومتوسط على الأربعين للنووي من المتقدمين ومن المتأخرين، من المطبوع والمخطوط، ومن المسموع والمقروء, كتب كثيرة جدًا.\n" +
                        "حتى من أشد الناس تحريًا للاتباع يشرحون الأربعين؛ لا لأنها أربعون، بل لأن هذه الأحاديث التي جمعت في الأربعين أحاديث في غاية الأهمية. لو أنها سبعين بهذه القوة والجودة وهذا الانتقاء، هل نقول: إن العالم الفلاني الذي شرحها على أساس أنها أربعين لو عرف أنها سبعين ما شرح؟ لا، إنما شرحها, واهتم بها أهل العلم لما لها من ميزة، فهذه أحاديث كما سيأتي في كلام المؤلف إنها من جوامع الكلم، وقيل في كثير منها: إن مدار الإسلام عليها، وربع الإسلام، وثلث الإسلام أو يدخل في جميع أبواب الدين، وهكذا على ما سيأتي إجمالًا في المقدمة، وتفصيلًا عند قراءة كل حديث.\n" +
                        "“وقوله -صلى الله عليه وسلم-: ((نضَّر الله امرءًا سمع مقالتي فوعاها فأداها كما سمعها))” فوعاها: يعني عقلها وحفظها. فأدَّاها أي إلى غيره, كما سمعها يعني بحروفها، لم يغير فيها شيئًا.\n" +
                        "قوله -رحمه الله-“ثم من العلماء من جمع الأربعين في أصول الدين” يعني في العقائد. “وبعضهم في الفروع” يعني في أحاديث الأحكام، فبعضهم في العبادات، بعضهم في المعاملات. “بعضهم في الجهاد، وبعضهم في الزهد، وبعضهم في الآداب، وبعضهم في الخطب” ومن آخر ما أُلّف “الأربعون المكية” يعني الكتاب فيه أربعون حديثًا في فضائل البلد الحرام، وألف من قِبَل مشروع تعظيم البلد الحرام, فهذا من أخر ما أُلّف. قول المؤلف -رحمه الله-: “وكلها مقاصد صالحة”، أي جيدة, فالذي يؤلف في الأصول له مقصد حسن وأن الاعتقاد هو الأصل، ومن ألف في الفروع، في العبادات أو المعاملات، ومن ألف في الجهاد -كل واحد منهم ألّف في باب يرى أن الحاجة داعية إلى التأليف فيه- فمقصده صالح – رضي الله عن هؤلاء المؤلفين.\n" +
                        "قوله -رحمه الله-“وقد رأيت جمع أربعين أهم من هذا كله”، هذه الأحاديث الأربعون جوامع وهي أصول للدين، لكن هل هي أهم من الأربعين في أصول الدين في العقائد؟ يقول: “وقد رأيت جمع أربعين” -وهي في حقيقتها اثنان وأربعون حديثًا لكنه جاري على طريقة العرب في حذف الكسر- “أهم من هذا كله وهي أربعون حديثًا مشتملةٌ على جميع ذلك”، يعني فيها من جميع الأبواب المذكورة، منتقاة من الأبواب المذكورة.\n" +
                        "\n" +
                        "قوله -رحمه الله- “وكل حديث منها قاعدة عظيمة من قواعد الدين” وسيأتي تقرير ذلك أثناء شرح الأحاديث.\n" +
                        "قوله -رحمه الله- “قد وصفه العلماء بأن مدار الإسلام عليه”. يعني كل حديث منها سيأتي -إن شاء الله تعالى- أن مدار الإسلام عليه, أو أنه نصف الإسلام، أو ثلثه، أو نحو ذلك.\n" +
                        "قال رحمه الله “ثم ألتزم في هذه الأربعين أن تكون صحيحة”، اشترط المؤلِّف أن تكون هذه الأربعين صحيحة, لكن ذلك من وجهة نظره, فقد صحح بعض الأحاديث التي يختلف في تصحيحها وهي يسيرة، اثنين، أو ثلاثة، أو أربعة لا تزيد على الخمسة.\n" +
                        "\n" +
                        "قوله -رحمه الله-“ومعظمها في صحيحي البخاري ومسلم، وأذكرها محذوفة الأسانيد؛ ليسهل حفظها”، وأذكرها محذوفة الأسانيد يعني من بعد الصحابي إذ العادة أن لا يذكر التابعي إلا إذا دعت الضرورة إليه بأن يكون طرفًا في المتن يعني سأل الصحابي فأجابه.\n" +
                        "قوله -رحمه الله-“ليسهل حفظها ويعم الانتفاع بها -إن شاء الله تعالى-“، ومما يعين على الحفظ صغر الحجم، قلة الألفاظ.\n" +
                        "قوله -رحمه الله-“ثم أُتبعها بباب في ضبط خفي ألفاظها” يعني بعد أن ذكر الأحاديث الاثنين والأربعين ذكر بابًا فيه الألفاظ الغريبة التي وردت في ثنايا الكتاب -في الأحاديث-.\n" +
                        "\n" +
                        "قوله -رحمه الله- “وينبغي لكل راغب في الآخرة” يعني كل حريص على نجاته،\n" +
                        "“أن يعرف هذه الأحاديث” يحفظ هذه الأربعين، ويفهم هذه الأربعين، ويقرأ ما كتب حولها لا سيما ما كتبه الحافظ ابن رجب في: “جامع العلوم والحكم” فليحرص طالب العلم عليه وليعضه بنواجذه.\n" +
                        "قوله -رحمه الله-“لما اشتملت عليه من المهمات، واحتوت عليه من التنبيه على جميع الطاعات وذلك ظاهر لمن تدبره ” صحيح أنها احتوت على جميع الطاعات، يأتي في حديث جبريل أنه اشتمل على كثير من أبواب الدين، ويأتي حديث بني الإسلام على خمس، ويأتي في غيرهما من الأحاديث ما يدل على ذلك.\n" +
                        "قوله -رحمه الله-“وعلى الله اعتمادي”، يعني اعتمادي على الله لا على غيره، وتقديم الجار والمجرور المعمول على عامله لإفادة الحصر، مثل قوله -عز وجل-: {إِيَّاكَ نَعْبُدُ} [(5) سورة الفاتحة].\n" +
                        "“وإليه تفويضي واستنادي، وله الحمد والنعمة، وبه التوفيق والعصمة”.\n" +
                        "\n" +
                        "والله أعلم، وصلى الله وسلم وبارك على عبده ورسوله نبينا محمد، وعلى آله وصحبه أجمعين.");
                startActivity(intent);

            }
        });
    }
}
